import 'package:admin_page/features/staff/widgets/actions_row.dart';
import 'package:admin_page/features/staff/widgets/lable.dart';
import 'package:admin_page/features/staff/widgets/tab_bar_selector.dart';
import 'package:flutter/material.dart';
import 'package:scrollable_table_view/scrollable_table_view.dart';

import 'widgets/users_table.dart';
import 'widgets/navigation.dart';

class Staff extends StatefulWidget {
  const Staff({super.key});

  @override
  State<Staff> createState() => _StaffState();
}

class _StaffState extends State<Staff> with TickerProviderStateMixin {
  late final tabBarContoller = TabController(length: 3, vsync: this);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: const EdgeInsets.only(left: 8.0, right: 16.0),
        child: Column(
          children: [
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: Lable(),
            ),
            Padding(
              padding: const EdgeInsets.only(top: 8.0, bottom: 8.0),
              child: TabBarSelector(
                tabBarController: tabBarContoller,
              ),
            ),
            Padding(
              padding: const EdgeInsets.all(8.0),
              child: const ActionsRow(),
            ),
            Expanded(
              child: Padding(
                padding: const EdgeInsets.all(8.0),
                child: TabBarView(
                  physics: NeverScrollableScrollPhysics(),
                  controller: tabBarContoller,
                  children: const [
                    UsersTable(
                      data: [
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Преподаватель",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                      ],
                    ),
                    UsersTable(
                      data: [
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Иван Иванович Иванов",
                          "Мужской",
                          "06.08.1996",
                          "Терен",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                      ],
                    ),
                    UsersTable(
                      data: [
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                        [
                          "Константинов Константин Константинович",
                          "Мужской",
                          "06.08.1996",
                          "Сотрудник",
                          "+7 (902) 111-10-02",
                          "Сегодня, 12:45",
                          "Просмотреть"
                        ],
                      ],
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
